; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v7)
		(pred_5 ?v8)
		(pred_4 ?v3)
		(pred_2 ?v3)
		(pred_6 ?v8 ?v3)
		(pred_1)
		(pred_3 ?v8))

   (:action op_2
       :parameters  (?v5 ?v1)
       :precondition (and (not-eq ?v5 ?v1) 
                          (pred_4 ?v5) (pred_4 ?v1) (pred_2 ?v5))
       :effect (and  (pred_2 ?v1)
		     (not (pred_2 ?v5))))


   (:action op_3
       :parameters (?v6 ?v4)
       :precondition  (and  (pred_5 ?v6) (pred_4 ?v4)
			    (pred_6 ?v6 ?v4) (pred_2 ?v4) (pred_1))
       :effect (and (pred_3 ?v6)
		    (not (pred_6 ?v6 ?v4)) 
		    (not (pred_1))))

   (:action op_1
       :parameters  (?v6  ?v4)
       :precondition  (and  (pred_5 ?v6) (pred_4 ?v4)
			    (pred_3 ?v6) (pred_2 ?v4))
       :effect (and (pred_6 ?v6 ?v4)
		    (pred_1)
		    (not (pred_3 ?v6)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_03 obj_05 obj_06 obj_02 obj_04 
          obj_01 obj_07 
)
(:init
(pred_4 obj_03)
(pred_4 obj_05)
(pred_4 obj_06)
(pred_4 obj_02)
(pred_4 obj_04)
(pred_5 obj_01)
(pred_5 obj_07)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(pred_1)
(pred_6 obj_01 obj_06)
(pred_6 obj_07 obj_04)
(pred_2 obj_02)
)
(:goal
(and
(pred_6 obj_01 obj_03)
(pred_6 obj_07 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_01 obj_03) (pred_2 obj_05))
    (sometime-before  (pred_6 obj_07 obj_05) (pred_2 obj_03))
  )
)
)

; plan
1. (op_2 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 0 of 2
2. (op_3 obj_07 obj_04)
   deleted: (pred_6 obj_07 obj_04) (pred_1)
   added: (pred_3 obj_07)
   goals met: 0 of 2
3. (op_2 obj_04 obj_06)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_06)
   goals met: 0 of 2
4. (op_2 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_05)
   goals met: 0 of 2
5. (op_2 obj_05 obj_03)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_03)
   goals met: 0 of 2
6. (op_1 obj_07 obj_03)
   deleted: (pred_3 obj_07)
   added: (pred_6 obj_07 obj_03) (pred_1)
   goals met: 0 of 2
7. (op_2 obj_03 obj_06)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_06)
   goals met: 0 of 2
8. (op_3 obj_01 obj_06)
   deleted: (pred_6 obj_01 obj_06) (pred_1)
   added: (pred_3 obj_01)
   goals met: 0 of 2
9. (op_2 obj_06 obj_03)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_03)
   goals met: 0 of 2
10. (op_1 obj_01 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_6 obj_01 obj_03) (pred_1)
   goals met: 1 of 2
11. (op_3 obj_07 obj_03)
   deleted: (pred_6 obj_07 obj_03) (pred_1)
   added: (pred_3 obj_07)
   goals met: 1 of 2
12. (op_2 obj_03 obj_05)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_05)
   goals met: 1 of 2
13. (op_1 obj_07 obj_05)
   deleted: (pred_3 obj_07)
   added: (pred_6 obj_07 obj_05) (pred_1)
   goals met: 2 of 2
